In [2]:
people = {
    'first': ['alek', 'nik', 'steve'],
    'last': ['d', 'a', 'v'],
    'email': ['ja@gmail.com', 'ti@gmail.com', 'on@gmail.com']
}

In [3]:
import pandas as pd

In [55]:
df = pd.DataFrame(people)

In [56]:
df

   first last         email
0   alek    d  ja@gmail.com
1    nik    a  ti@gmail.com
2  steve    v  on@gmail.com

In [57]:
df.columns = ['ime', 'prezime', 'email']

In [58]:
df

     ime prezime         email
0   alek       d  ja@gmail.com
1    nik       a  ti@gmail.com
2  steve       v  on@gmail.com

In [59]:
df.rename(columns={'email': 'e_adresa'}, inplace=True)

In [60]:
df

     ime prezime      e_adresa
0   alek       d  ja@gmail.com
1    nik       a  ti@gmail.com
2  steve       v  on@gmail.com

In [61]:
df.loc[0]['prezime']

'd'

## Filter

In [62]:
filt = (df['e_adresa'] == 'ja@gmail.com')

In [63]:
df[filt]

    ime prezime      e_adresa
0  alek       d  ja@gmail.com

In [64]:
df[filt]['prezime']

0    d
Name: prezime, dtype: object

In [65]:
df[filt]['prezime'] = 'Dimitrievski'

<ipython-input-65-de632bb5ec19>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['prezime'] = 'Dimitrievski'

In [66]:
df.loc[filt, 'prezime'] = 'Dimitrievski'

In [67]:
df

     ime       prezime      e_adresa
0   alek  Dimitrievski  ja@gmail.com
1    nik             a  ti@gmail.com
2  steve             v  on@gmail.com

In [68]:
df['e_adresa'] = df['e_adresa'].str.upper()

In [69]:
df

     ime       prezime      e_adresa
0   alek  Dimitrievski  JA@GMAIL.COM
1    nik             a  TI@GMAIL.COM
2  steve             v  ON@GMAIL.COM

## Apply

In [70]:
df['e_adresa'].apply(len)

0    12
1    12
2    12
Name: e_adresa, dtype: int64

In [81]:
def update_email(email):
    return email.lower()

In [82]:
df['e_adresa'].apply(update_email)

0    ja@gmail.com
1    ti@gmail.com
2    on@gmail.com
Name: e_adresa, dtype: object

In [84]:
df['e_adresa'].apply(lambda x: x.upper())

0    JA@GMAIL.COM
1    TI@GMAIL.COM
2    ON@GMAIL.COM
Name: e_adresa, dtype: object

In [85]:
df.apply(len)

ime         3
prezime     3
e_adresa    3
dtype: int64

In [86]:
df.apply(pd.Series.min)

ime                 alek
prezime     Dimitrievski
e_adresa    JA@GMAIL.COM
dtype: object

In [88]:
df.apply(lambda x: x.min())

ime                 alek
prezime     Dimitrievski
e_adresa    JA@GMAIL.COM
dtype: object

## Apply Map

In [89]:
df.applymap(len)

   ime  prezime  e_adresa
0    4       12        12
1    3        1        12
2    5        1        12

In [94]:
df.applymap(str.upper)

     ime       prezime      e_adresa
0   ALEK  DIMITRIEVSKI  JA@GMAIL.COM
1    NIK             A  TI@GMAIL.COM
2  STEVE             V  ON@GMAIL.COM

## Map

In [97]:
df['ime'].map({'alek': 'aleksandar', 'nik': 'nikola',})

0    aleksandar
1        nikola
2           NaN
Name: ime, dtype: object

In [101]:
df['e_adresa'].map({'@': True})

0    NaN
1    NaN
2    NaN
Name: e_adresa, dtype: object

## Replace

In [99]:
df['ime'].replace({'alek': 'aleksandar', 'nik': 'nikola',})

0    aleksandar
1        nikola
2         steve
Name: ime, dtype: object